seasons_list = ["", "Зима", "Зима",
                "Весна", "Весна", "Весна",
                "Лето", "Лето", "Летоа",
                "Осень", "Осень", "Зима",
                "Зима"]
seasons_dict = {1: "Зима", 2: "Зима",
                3: "Весна", 4: "Весна", 5: "Весна",
                6: "Лето", 7: "Лето", 8: "Лето",
                9: "Осень", 10: "Осень", 11: "Зима",
                12: "Зима"}

m = int(input("Введите месяц: "))
print('Сезон по словарю -', seasons_dict[m])
print('Сезон по списку -', seasons_list[m])
